Documents/Д_ЗакрытиеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>Д_ЗакрытиеОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Учетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ChartsOfAccounts/Учетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfAccounts>
		<Properties>
			<Name>Учетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтражаетсяВБалансе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДенежныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Крахмал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

Documents/Д_ЗакрытиеОстатков/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетныйОстатки.Счет,
		|	БюджетныйОстатки.Субконто1,
		|	БюджетныйОстатки.Субконто2,
		|	БюджетныйОстатки.Субконто3,
		|	БюджетныйОстатки.Предприятия,
		|	БюджетныйОстатки.СценарийПлана,
		|	БюджетныйОстатки.Подразделение,
		|	БюджетныйОстатки.СуммаОстаток,
		|	БюджетныйОстатки.СуммаОстатокДт,
		|	БюджетныйОстатки.СуммаОстатокКт,
		|	БюджетныйОстатки.КоличествоОстаток,
		|	БюджетныйОстатки.КоличествоОстатокДт,
		|	БюджетныйОстатки.КоличествоОстатокКт,
		|	БюджетныйОстатки.КоличествоКРХОстаток,
		|	БюджетныйОстатки.КоличествоКРХОстатокДт,
		|	БюджетныйОстатки.КоличествоКРХОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.Бюджетный.Остатки(&ДатаКонца, , , СценарийПлана = &ВыбСценарий) КАК БюджетныйОстатки";

	Запрос.УстановитьПараметр("ВыбСценарий", Сценарий);
	Запрос.УстановитьПараметр("ДатаКонца", Дата);
	
	//Запрос.УстановитьПараметр("Счет", ПланыСчетов.Учетный.Счет7601());

	Результат = Запрос.Выполнить();
                                                                 
	Выборка = Результат.Выбрать();

	Движения.Бюджетный.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		СчетДебет =  Выборка.Счет;
		Движение = Движения.Бюджетный.Добавить();
		Движение.СчетДт = СчетДебет;
		Если НЕ СчетДебет.Забалансовый Тогда
			Движение.СчетКт = ПланыСчетов.Учетный.Счет00();
		КонецЕсли;
		Движение.Период = Дата;
		Движение.Предприятия = Выборка.Предприятия;
		Движение.СценарийПлана = Сценарий;
		Движение.Сумма = -Выборка.СуммаОстаток;
		Если НЕ Выборка.Субконто1 = Null Тогда
			УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДебет,1,Выборка.Субконто1);
		Иначе
			а = 11;
		КонецЕсли;
		Если НЕ Выборка.Субконто2 = Null Тогда
			УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДебет,2,Выборка.Субконто2);
		КонецЕсли;
		Если НЕ Выборка.Субконто3 = Null Тогда
			УЧ_Сервер.УстановитьСубконто(Движение.СубконтоДт,СчетДебет,3,Выборка.Субконто3);
		КонецЕсли;
		
		//количество
		Если СчетДебет.Количественный Тогда
			Движение.КоличествоДт = -Выборка.КоличествоОстаток;
		КонецЕсли;
		//крахмал
		Если СчетДебет.Крахмал Тогда
			Движение.КоличествоКРХДт  = -Выборка.КоличествоКРХОстаток;
		КонецЕсли;
		//подразделение
		Если СчетДебет.УчетПоПодразделениям Тогда
		    Движение.ПодразделениеДт = Выборка.Подразделение;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//из подписки на событие
	БюджетныйНаСервере.ДокументыПередЗаписьюПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	БюджетныйНаСервере.ПриУстановкеНовогоНомераПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры
